{
  "users": [
    {
      "email": "alanriven@gmail.com",
      "password": "$2a$10$GByRbXSuOd..6HngaPCkquwrj3W7uPm/N6bZRrwocVV1o0/qsQU7K",
      "name": "huysinger",
      "id": 4,
      "orders": {}
    },
    {
      "email": "huy123@gmail.com",
      "password": "$2a$10$FYa1XqI2t1mUjXSVHHbm9.t0eXgMiM5PLp5nJAfeHb4Fg.mVGE23e",
      "name": "huy123",
      "id": 5
    },
    {
      "email": "huy1234@gmail.com",
      "password": "$2a$10$.2RuMb27/KyXkkAcbOMPDuSAnU1/mCXO.8FkXju7ECmOW7drDNUdu",
      "name": "huy1234",
      "id": 6
    },
    {
      "email": "huydeptrai@gmail.com",
      "password": "$2a$10$WEbDPzsF86UrrtH7VAM/8OXA.vurh.PIS9vFdAfLQYjsvD8nqdFrK",
      "name": "huydeptrai",
      "id": 7
    },
    {
      "email": "huynguyen@gmail.com",
      "password": "$2a$10$OEXOmQ1OCLYyYBSkYeZVNuKNYvAICZNZhgU48CdeR4Px4iOnDbAiK",
      "name": "Huy Nguyen",
      "id": 8
    }
  ],
  "products": [
    {
      "id": 8,
      "name": "iPhone 13",
      "price": "16000000",
      "category": "Iphone",
      "likes": 12,
      "order": 20,
      "url": "https://cdn2.cellphones.com.vn/358x358,webp,q100/media/catalog/product/1/4/14_1_9_2_9.jpg",
      "description": "Cuối năm 2020, bộ 4 iPhone 12 đã được ra mắt với nhiều cái tiến. Sau đó, mọi sự quan tâm lại đổ dồn vào sản phẩm tiếp theo – iPhone 13. Vậy iP 13 sẽ có những gì nổi bật, hãy tìm hiểu ngay sau đây nhé!",
      "quantity": 1
    },
    {
      "name": "Google Pixel 6",
      "description": "Khi nhắc đến những chiếc smartphone chạy Android One thì chúng ta sẽ nghĩ ngay đến chiếc Google Pixel 6 lừng danh. Mới đây đã có những thông tin về thế hệ Pixel mới nhất là Google Pixel 6. Cùng nhau tham khảo về tổng hợp những thông tin nghe đồn về chiếc Google Pixel 6 này nhé.",
      "category": "Google",
      "price": 10000000,
      "likes": 11,
      "order": 16,
      "url": "https://cdn.tgdd.vn/Products/Images/42/233009/google-pixel-6-600x600.jpg",
      "id": 10,
      "quantity": 4
    },
    {
      "name": "Xiaomi 13 Ultra",
      "description": "Xiaomi 13 Ultra hiện là mẫu flagship có hệ thống camera chụp ảnh tốt nhất trên thế giới tại thời điểm hiện tại. Với ống kính Leica Summicron, hệ thống máy ảnh này được phát triển với sự hợp tác của Leica cùng cảm biến Sony 1 inch từ mẫu Pro, Xiaomi 13 Ultra có thể mang lại một số cải tiến trong lĩnh vực chụp ảnh macro.",
      "category": "Xiaomi",
      "price": 20000000,
      "likes": 10,
      "order": 18,
      "url": "https://mobileworld.com.vn/uploads/product/Xiaomi_13_series/thumbs/xiaomi_13_ultra_den.webp",
      "id": 11,
      "quantity": 1
    },
    {
      "name": "iPhone 14 Pro Max",
      "description": "iPhone 14 Pro Max một siêu phẩm trong giới smartphone được nhà Táo tung ra thị trường vào tháng 09/2022. Máy trang bị con chip Apple A16 Bionic vô cùng mạnh mẽ, đi kèm theo đó là thiết kế hình màn hình mới, hứa hẹn mang lại những trải nghiệm đầy mới mẻ cho người dùng iPhone.",
      "category": "Iphone",
      "price": 30000000,
      "likes": 9,
      "url": "https://cdn2.cellphones.com.vn/358x358,webp,q100/media/catalog/product/t/_/t_m_18.png",
      "id": 12,
      "order": 22,
      "quantity": 2
    },
    {
      "name": "Xiaomi Redmi Note 12 Pro 5G",
      "description": "Xiaomi Redmi Note 12 Pro sở hữu cấu hình vượt trội gồm chip MediaTek Dimensity 1080, hệ thống ba camera với cảm biến chính 50MP và mạng 5G. Ngoài ra, màn hình Note 12 Pro 5G có kích thước khá lớn khoảng 6.67 inch, tấm nền AMOLED, tần số quét 120Hz khiến chiếc điện thoại nổi bật trong tầm giá dưới 8 triệu.",
      "category": "Xiaomi",
      "price": 9000000,
      "url": "https://cdn2.cellphones.com.vn/358x358,webp,q100/media/catalog/product/g/t/gtt7766.jpg",
      "likes": 0,
      "order": 12,
      "id": 13
    },
    {
      "name": "Xiaomi 12T",
      "description": "Xiaomi 12T là sản phẩm được nhiều tín đồ công nghệ đánh giá cao với màn hình AMOLED 6.67 inch độ phân giải cao, tần số quét 120Hz, chip MediaTek Dimensity 8100-Ultra, RAM 8GB và bộ nhớ trong 128GB. Thêm vào đó camera chính 108MP hỗ trợ chống rung OIS và sạc nhanh 120W cho trải nghiệm sử dụng cực chất. ",
      "category": "Xiaomi",
      "price": "10000000",
      "url": "https://cdn2.cellphones.com.vn/358x358,webp,q100/media/catalog/product/x/i/xiaomi-12t-den_1.jpg",
      "likes": 0,
      "order": 0,
      "id": 14
    },
    {
      "name": "Xiaomi 12 Pro (5G)",
      "description": "Là một trong những dòng smartphone chủ lực của hãng, Xiaomi 12 Pro sở hữu một thiết kế ấn tượng cùng hiệu năng vượt trội mang lại trải nghiệm dùng mượt mà. Bên cạnh đó, máy còn được trang bị hệ thống camera vô cùng chất lượng cho ra những bức ảnh chuyên nghiệp. Tháng 10/2022, Xiaomi đã trình làng phiên bản Xiaomi 12T Pro cực kỳ ấn tượng mà quý khách nên xem qua!",
      "category": "Xiaomi",
      "price": "15000000",
      "url": "https://cdn2.cellphones.com.vn/358x358,webp,q100/media/catalog/product/x/i/xiaomi-12-pro_arenamobiles.jpg",
      "likes": 0,
      "order": 0,
      "id": 15
    },
    {
      "name": "Samsung Galaxy S23 Ultra",
      "description": "Samsung S23 Ultra là dòng điện thoại cao cấp của Samsung, sở hữu camera độ phân giải 200MP ấn tượng, chip Snapdragon 8 Gen 2 mạnh mẽ, bộ nhớ RAM 8GB mang lại hiệu suất xử lý vượt trội cùng khung viền vuông vức sang trọng. Sản phẩm được ra mắt từ đầu năm 2023.",
      "category": "Samsung",
      "price": "24000000",
      "url": "https://cdn2.cellphones.com.vn/358x358,webp,q100/media/catalog/product/g/a/galaxys23ultra_front_green_221122_2.jpg",
      "likes": 0,
      "order": 0,
      "id": 1
    },
    {
      "name": "Samsung Galaxy Z Fold5",
      "description": "Samsung Z Fold5 được trang bị con chip Snapdragon 8 Gen 2 mạnh mẽ, bộ nhớ RAM 12GB, ống kính chính 50MP, camera selfie bên ngoài 10MP, camera màn hình chính 4MP. Bên cạnh đó, điện thoại Samsung này còn sở hữu tấm nền Dynamic AMOLED 2X, kích thước màn hình 7.6 inch khi mở, độ phân giải 2K cho hình ảnh rõ nét cùng với dung lượng pin 4.400 mAh thoải mái sử dụng.",
      "category": "Samsung",
      "price": "40000000",
      "url": "https://cdn2.cellphones.com.vn/358x358,webp,q100/media/catalog/product/b/4/b48cd136-7366-4d01-8d58-8ee3d5dc93b7_1.jpg",
      "likes": 5,
      "order": 0,
      "id": 17
    },
    {
      "name": "OPPO Reno10 5G",
      "description": "Điện thoại OPPO Reno 10 sở hữu hiệu năng vô cùng mạnh mẽ khi được trang bị chipset MediaTek Dimensity 7050. Chất lượng hình ảnh của máy có độ sắc nét, mượt mà nhờ sở hữu tấm nền 3D AMOLED hiện đại với độ phân giải FHD+ 2412 × 1080 pixel cùng tần số quét 120Hz. Bên cạnh đó, Reno 10 còn sở hữu một vài ưu điểm khác như dung lượng Pin 5000mAh với sạc nhanh SUPERVOOC 67W cùng cụm camera 64MP sắc nét giúp nâng cao trải nghiệm của người dùng.",
      "category": "OPPO",
      "price": "11000000",
      "url": "https://cdn2.cellphones.com.vn/358x358,webp,q100/media/catalog/product/r/e/reno10_5g_-_combo_product_-_blue.png",
      "likes": 0,
      "order": 22,
      "id": 18,
      "quantity": 2
    },
    {
      "name": "OPPO Find N2 Flip",
      "description": "OPPO Find N2 Flip dự kiến sẽ là chiếc điện thoại khiến nhiều tín đồ công nghệ quan tâm khi sở hữu thiết kế bắt mắt, cùng màn hình ấn tượng. Đi cùng với đó là hệ thống camera của thiết bị cũng cao cấp không kém khi tích hợp đầy đủ các cảm biến, cùng đa dạng tính năng chụp ảnh.",
      "category": "OPPO",
      "price": "20000000",
      "url": "https://cdn2.cellphones.com.vn/358x358,webp,q100/media/catalog/product/n/2/n2_flip_-_combo_product_-_black.png",
      "likes": 4,
      "order": 0,
      "id": 19
    },
    {
      "name": "iPhone 13 Pro Max",
      "description": "iPhone 12 ra mắt cách đây chưa lâu, thì những tin đồn mới nhất về iPhone 13 Pro Max đã khiến bao tín đồ công nghệ ngóng chờ. Cụm camera được nâng cấp, màu sắc mới, đặc biệt là màn hình 120Hz với phần notch được làm nhỏ gọn hơn chính là những điểm làm cho thu hút mọi sự chú ý trong năm nay.",
      "category": "Iphone",
      "price": "25000000",
      "url": "https://cdn2.cellphones.com.vn/358x358,webp,q100/media/catalog/product/3/_/3_51_1_7.jpg",
      "likes": 10,
      "order": 0,
      "id": 20
    }
  ],
  "posts": [
    {
      "title": "Apple phát hành iOS 17 và iPadOS 17 beta 5, bạn đã cập nhật chưa?",
      "content1": "Apple hôm nay đã tung ra bản beta thứ năm của các bản cập nhật iOS 17 và iPadOS 17 sắp tới cho các nhà phát triển nhằm mục đích thử nghiệm. Được biết, phần mềm mới xuất hiện sau khoảng 2 tuần kể từ khi Apple tung ra bản iOS/iPadOS 17 beta 4.",
      "content2": "Hiện tại, các nhà phát triển đã đăng ký có thể chọn tham gia các bản thử nghiệm mới bằng cách mở ứng dụng Cài đặt, chuyển đến phần Cập nhật phần mềm, nhấn vào tùy chọn Cập nhật Beta và bật iOS 17 Beta dành cho nhà phát triển. Lưu ý rằng, để tải xuống iOS 17 và iPadOS 17 beta 5 thì bạn cần sử dụng Apple ID được liên kết với tài khoản nhà phát triển.",
      "content3": "Dù không phải là một bản cập nhật lớn nhưng iOS 17 vẫn mang đến khá nhiều tính năng đáng chú ý cho người dùng. Một trong số đó là posters, tính năng biến liên hệ thành hình ảnh hiển thị toàn màn hình trên iPhone của người nhận khi bạn gọi cho họ.",
      "category": "Công nghệ",
      "date": "9/8/2023",
      "url": "https://cdn.sforum.vn/sforum/wp-content/uploads/2023/08/General-iOS-17-Feature-Orange-Pu.jpeg",
      "id": 1
    },
    {
      "title": "Galaxy A05 lộ điểm hiệu năng khá tốt trên Geekbench với chip Helio G85",
      "content1": "Galaxy A05 là mẫu smartphone giá rẻ tiếp theo sẽ được Samsung ra mắt trong thời gian tới. Điện thoại này gần đây đã được phát hiện trên một số trang web chứng nhận với số model SM-A055F và SM-A055M.",
      "content2": "Hôm nay, biến thể SM-A055F của Galaxy A05 vừa được thử nghiệm hiệu năng trên Geekbench. Nhờ đó mà chúng ta có được một vài thông tin cấu hình của điện thoại này.",
      "content3": "Cụ thể, dữ liệu từ Geekbench cho thấy Galay A05 sẽ được cung cấp sức mạnh đến từ con chip MediaTek Helio G85 (MT6769V/CZ). Đây là một bản nâng cấp khá tốt so với Galaxy A04 sử dụng SoC Helio P35. Dù cả hai đều là chip 12nm, nhưng G85 có hai lõi Cortex-A75 (2.0GHz) và sáu lõi A55 (1.8GHz), so với tám lõi Cortex-A53 trên P35. Điều này giúp Galaxy A05 có hiệu suất đơn và đa lõi tốt hơn thế hệ trước. Chưa hết, Mali-G52 MC2 nhanh hơn gấp đôi so với GPU PowerVR GE8320.",
      "category": "Công nghệ",
      "date": "9/8/2023",
      "url": "https://cdn.sforum.vn/sforum/wp-content/uploads/2023/08/Galaxy-A05-Geekbench-cover.jpeg",
      "id": 2
    },
    {
      "title": "Sau Tốc Chiến và LMHT, \"đấng\" Yasuo tiếp tục khuấy đảo một tựa game mới: Project L",
      "content1": "Một trong những câu hỏi được nhiều người chơi bày tỏ sự quan tâm nhất trong những ngày qua là: “Phiên bản beta Project L đã được Riot đưa vào những vị tướng nào?”. Vậy thì hãy cùng S-Games điểm qua trong bài viết dưới đây nhé!",
      "content2": "Hiện tại, bản beta Project L đã được Riot mở và có sẵn 7 tướng để người chơi vào trải nghiệm. Tuy người chơi có hơi chút thất vọng khi không thể đưa cùng lúc tất cả 164 vị tướng LMHT hiện hành vào Project L, nhưng họ cũng rất phấn khởi trải nghiệm tựa game với những phong cách chiến đấu đối kháng vô cùng đặc sắc của nhóm tướng có sẵn này. Dưới đây là thông tin về 7 tướng được cập nhật trong phiên bản beta lần này.",
      "content3": "Vị tướng này là kiếm sĩ bậc thầy, người sở hữu nhiều thứ công cụ đa dụng trong hầu hết các tình huống và luôn tạo ra những pha xử lý xuất thần, mãn nhãn cả ở phương diện cá nhân lẫn kết hợp đồng đội. Yasuo cũng sở hữu Tường Gió đáng tin cậy để ngăn chặn những kỹ năng định hướng và cả cú lướt cho ai thích lôi chơi uyển chuyển, hoa mỹ.",
      "category": "Games",
      "date": "9/8/2023",
      "url": "https://cdn.sforum.vn/sforum/wp-content/uploads/2023/08/project-l-0.jpg",
      "id": 3
    },
    {
      "title": "Galaxy S24 Ultra sẽ nhận được nâng cấp khủng về camera",
      "category": "Công nghệ",
      "url": "https://cdn.sforum.vn/sforum/wp-content/uploads/2023/08/Galaxy-S24-Ultra-camera.jpeg",
      "content1": "Mặc dù phải còn khá lâu nữa Samsung mới ra mắt loạt flagship Galaxy S24 mới nhưng thời gian qua, thông tin về các điện thoại này đã liên tục được chia sẻ trên các trang mạng.",
      "content2": "Dự kiến, dòng sản phẩm này sẽ tiếp tục có 3 model là Galaxy S24, S24+ và S24 Ultra. Hôm nay, một nguồn uy tín vừa chia sẻ thông tin máy ảnh của biến thể “Ultra” cao cấp nhất.",
      "content3": "Cụ thể, leaker đáng tin cậy Ice Universe vừa tiết lộ thông tin cho biết Galaxy S24 Ultra sẽ có máy ảnh tele được nâng cấp. Nó được cho là sẽ sử dụng camera tele 50MP với zoom quang học 3x. Đó là độ phân giải gấp năm lần so với camera tele 3x trên Galaxy S23 Ultra. Ngoài ra, máy ảnh mới của S24 Ultra cũng được cho là có kích thước cảm biến lớn hơn, hứa hẹn mang tới những bức ảnh thu phóng chất lượng hơn cho người dùng.",
      "id": 4,
      "date": "9/8/2023"
    },
    {
      "title": "Hé lộ các biến thể màu sắc, RAM và ROM của Galaxy Tab S9 FE",
      "content1": "Samsung hiện đang làm việc trên các tablet tầm trung Galaxy Tab S9 FE series để sớm giới thiệu với người dùng trong thời gian tới.",
      "content2": "Hôm nay, nguồn tin đến từ trang 91mobiles vừa độc quyền chia sẻ cho chúng ta thông tin về các biến thể màu sắc, RAM và ROM của model Tab S9 FE tiêu chuẩn.",
      "url": "https://cdn.sforum.vn/sforum/wp-content/uploads/2023/08/Samsung-Galaxy-Tab-S9-FE-5G-gia-cover.jpeg",
      "content3": "Theo hình ảnh rò rỉ mới nhất, mẫu Galaxy Tab S9 FE 5G sẽ có giá 65,000 INR (khoảng 18.65 triệu đồng) tại Ấn Độ. Giá này sẽ dành cho cấu hình 6GB RAM + 128GB. Mặt khác, biến thể Galaxy Tab S9 FE Wi-Fi với RAM 6GB và bộ nhớ trong 128GB sẽ có giá 63,000 (khoảng 18 triệu đồng). Ngoài cấu hình 6GB/128GB, máy tính bảng này cũng có thể được giới thiệu với nhiều tùy chọn RAM và dung lượng lưu trữ hơn. Ngoài ra, trang Mysmartprice còn cho biết Tab S9 FE sẽ ra mắt với các tùy chọn màu Bạc, Xanh lục nhạt và Xám.",
      "category": "Công nghệ",
      "date": "10/8/2023",
      "id": 5
    },
    {
      "title": "Rockstar tung siêu phẩm Red Dead Redemption lên Nintendo Switch và PS4!",
      "content1": "Rockstar tung siêu phẩm Red Dead Redemption lên Nintendo Switch và PS4, nhưng bị fan phản đối mãnh liệt",
      "content2": "Red Dead Redemption là một trong những trò chơi hay nhất mọi thời đại, được phát hành lần đầu vào năm 2010 và chỉ có mặt trên 2 hệ máy cũ là PlayStation 3, Xbox 360. Giờ đây, trò chơi sẽ nhanh chóng được ra mắt trên PlayStation 4 và Nintendo Switch nhờ sự giúp đỡ từ nhà phát triển Double Eleven Studios.",
      "url": "https://cdn.sforum.vn/sforum/wp-content/uploads/2023/08/red-dead-redemption-1.jpg",
      "content3": "Theo Rockstar, đây không phải là một bản remake hay remaster mà là một bản chuyển đổi được bổ sung thêm nhiều ngôn ngữ hỗ trợ mới như tiếng Trung, Hàn, Ba Lan,... Trò chơi sẽ có giá 49.99 USD trên Nintendo Switch eShop và PlayStation Store, còn phiên bản vật lý sẽ được phát hành trễ hơn vào ngày 13/10. Tuy nhiên các fan chỉ trích Rockstar là đã không update thêm bất kỳ tính năng mới nào mà lại đặt giá quá cao cho một trò chơi đã 13 năm tuổi. Sếp Rockstar thì lại nói rằng đây là giá \"phù hợp thị trường\" - hay nói cách khác là kiểu gì cũng có nguời mua.",
      "category": "Games",
      "date": "10/8/2023",
      "id": 6
    },
    {
      "title": "LMHT: Dìm hàng Faker, \"vua vạ miệng\" Thorin nhận gạch đá dữ dội",
      "content1": "Nam MC Thorin mới đây đã phải hứng chịu chỉ trích nặng nề sau phát ngôn gây tranh cãi liên quan đến hai tuyển thủ LMHT Faker và Xiaohu.",
      "content2": "Faker vẫn luôn là tượng đài của giới LMHT nói riêng và thể thao điện tử nói chung với bộ sưu tập thành tích đồ sộ cùng sức ảnh hưởng to lớn. Ở thời điểm hiện tại, mặc dù không còn giữ được phong độ đỉnh cao nhưng Quỷ Vương vẫn cho thấy vai trò quan trọng của mình tại T1. Giai đoạn Faker phải nghỉ thi đấu vì chấn thương là minh chứng rõ nét nhất cho việc tập thể T1 dễ bị đánh bại ra sao nếu thiếu Faker ở khu vực đường giữa.",
      "url": "https://cdn.sforum.vn/sforum/wp-content/uploads/2023/08/dim-hang-faker-nam-mc-nhan-gach-da-du-doi-3.jpg",
      "content3": "Tuy nhiên mới đây, Thorin - một MC tại khu vực LEC đã \"đụng tổ kiến lửa\" khi có phát ngôn gây tranh cãi về Faker. Cụ thể, sau khi chứng kiến màn trình diễn của Xiaohu cùng WBG tại vòng loại khu vực LPL, MC Thorin đã không tiếc lời khen cho cựu đường giữa của RNG. Tuy nhiên, anh chàng MC này lại lôi Faker vào câu chuyện và \"hạ thấp\" Quỷ Vương để ca ngợi Xiaohu.\n\"Xiaohu is who Faker fans think he is\" (tạm dịch \"Xiaohu chính là người mà fan Faker nghĩ rằng Quỷ Vương là như vậy\") - MC Thorin viết trên Twitter.\nNgay lập tức, sự so sánh có phần khập khiễng này đã nhận về vô số ý kiến chỉ trích từ phía game thủ LMHT nói chung và fan hâm mộ Faker nói riêng. Xét về lịch sử đối đầu cũng như bảng thành tích, Faker hoàn toàn vượt trội so với Xiaohu, đồng thời đường giữa của WBG luôn là bại tướng của Quỷ Vương và T1 tại các kì CKTG. Xiaohu cũng chưa thể giành lấy danh hiệu CKTG đầu tiên mặc dù đã sở hữu 2 chiếc cúp MSI trong màu áo RNG.",
      "category": "Games",
      "date": "14/8/2023",
      "id": 7
    }
  ]
}